In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
ds= pd.read_csv("raw_messy_dataset.csv")
ds.head(10)

,Name,Age,Gender,Email,Join_Date,Salary,Department
0,Alice,NaN,NaN,user0@example.com,2021-05-21,NaN,Admin
1,Bob,40,M,user1@example.com,NaN,50000,Engineering
2,Charlie,unknown,Male,user2@example.com,2020/01/01,50000,HR
3,David,NaN,NaN,user3@example.com,2021-05-21,70000,Admin
4,Eva,35,Other,user4@example.com,"July 4, 2020",70000,Engineering
5,Frank,unknown,Other,user5@example.com,NaN,70000,Admin
6,Grace,unknown,Female,user6@example.com,"July 4, 2020",80000,Engineering
7,Hannah,NaN,Other,user7@example.com,2021-05-21,NaN,HR
8,Ivy,30,Female,user8@example.com,NaN,50000,Engineering
9,Jack,35,Male,user9@example.com,2020/01/01,80000,Engineering

In [5]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105 entries, 0 to 104
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        105 non-null    object
 1   Age         72 non-null     object
 2   Gender      89 non-null     object
 3   Email       95 non-null     object
 4   Join_Date   70 non-null     object
 5   Salary      78 non-null     object
 6   Department  89 non-null     object
dtypes: object(7)
memory usage: 5.9+ KB

In [6]:
ds.duplicated().sum()

5

In [7]:
ds.describe()

         Name Age Gender              Email   Join_Date Salary   Department
count     105  72     89                 95          70     78           89
unique     10   5      5                 90           4      5            5
top     Alice  40   Male  user0@example.com  2021-05-21  50000  Engineering
freq       11  22     22                  2          26     22           26

In [8]:
ds.drop_duplicates(inplace = True)

In [9]:
ds.columns

Index(['Name', 'Age', 'Gender', 'Email', 'Join_Date', 'Salary', 'Department'], dtype='object')

In [10]:
ds["Email"].fillna("_", inplace=True)

C:\Users\omdeo\AppData\Local\Temp\ipykernel_31840\2936381552.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Email"].fillna("_", inplace=True)

In [11]:
ds["Join_Date"] = pd.to_datetime(ds["Join_Date"],errors = 'coerce')

In [12]:
ds["Salary"] = pd.to_numeric(ds["Salary"],errors = 'coerce')

In [13]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        100 non-null    object
 1   Age         69 non-null     object
 2   Gender      86 non-null     object
 3   Email       100 non-null    object
 4   Join_Date   24 non-null     datetime64[ns]
 5   Salary      60 non-null     float64
 6   Department  84 non-null     object
dtypes: datetime64[ns](1), float64(1), object(5)
memory usage: 6.2+ KB

In [14]:
y = ds["Department"].mode()[0]
ds["Department"].fillna(y,inplace = True)
ds["Department"].unique()

C:\Users\omdeo\AppData\Local\Temp\ipykernel_31840\2414529606.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  ds["Department"].fillna(y,inplace = True)

array(['Admin', 'Engineering', 'HR', 'Sales', 'Marketing'], dtype=object)

In [15]:
ds.to_csv("cleaned.csv")

In [16]:
print(ds.to_string())

       Name      Age  Gender               Email  Join_Date   Salary   Department
0     Alice      NaN     NaN   user0@example.com 2021-05-21      NaN        Admin
1       Bob       40       M   user1@example.com        NaT  50000.0  Engineering
2   Charlie  unknown    Male   user2@example.com        NaT  50000.0           HR
3     David      NaN     NaN   user3@example.com 2021-05-21  70000.0        Admin
4       Eva       35   Other   user4@example.com        NaT  70000.0  Engineering
5     Frank  unknown   Other   user5@example.com        NaT  70000.0        Admin
6     Grace  unknown  Female   user6@example.com        NaT  80000.0  Engineering
7    Hannah      NaN   Other   user7@example.com 2021-05-21      NaN           HR
8       Ivy       30  Female   user8@example.com        NaT  50000.0  Engineering
9      Jack       35    Male   user9@example.com        NaT  80000.0  Engineering
10    Alice      NaN       M  user10@example.com 2021-05-21  70000.0  Engineering
11      Bob       35       M  user11@example.com        NaT  50000.0        Sales
12  Charlie       35       M  user12@example.com        NaT  80000.0        Sales
13    David  unknown   Other  user13@example.com        NaT      NaN        Sales
14      Eva       40    Male  user14@example.com        NaT  80000.0           HR
15    Frank       35   Other  user15@example.com        NaT      NaN        Admin
16    Grace      NaN   Other  user16@example.com 2021-05-21  70000.0  Engineering
17   Hannah  unknown    Male  user17@example.com        NaT      NaN  Engineering
18      Ivy       30    Male  user18@example.com 2021-05-21  50000.0  Engineering
19     Jack       40    Male  user19@example.com        NaT  70000.0           HR
20    Alice      NaN    Male  user20@example.com 2021-05-21  50000.0  Engineering
21      Bob      NaN       M  user21@example.com        NaT      NaN        Sales
22  Charlie       30       F  user22@example.com        NaT  60000.0  Engineering
23    David       40       F  user23@example.com        NaT      NaN    Marketing
24      Eva  unknown    Male  user24@example.com        NaT  60000.0  Engineering
25    Frank       25       F  user25@example.com        NaT  60000.0        Sales
26    Grace       40       F  user26@example.com        NaT      NaN    Marketing
27   Hannah       30    Male  user27@example.com 2021-05-21  70000.0  Engineering
28      Ivy      NaN       F  user28@example.com        NaT      NaN    Marketing
29     Jack  unknown   Other  user29@example.com 2021-05-21  50000.0        Sales
30    Alice       40  Female  user30@example.com 2021-05-21  80000.0        Admin
31      Bob       25  Female  user31@example.com        NaT  50000.0        Admin
32  Charlie       25    Male  user32@example.com 2021-05-21  80000.0    Marketing
33    David       35       M  user33@example.com        NaT  50000.0           HR
34      Eva       35    Male  user34@example.com        NaT      NaN    Marketing
35    Frank      NaN       M  user35@example.com        NaT      NaN  Engineering
36    Grace       30  Female  user36@example.com        NaT  80000.0  Engineering
37   Hannah       40    Male  user37@example.com        NaT      NaN        Admin
38      Ivy       40     NaN  user38@example.com 2021-05-21  70000.0           HR
39     Jack      NaN   Other  user39@example.com 2021-05-21  50000.0        Sales
40    Alice      NaN       F  user40@example.com        NaT  50000.0  Engineering
41      Bob      NaN       M  user41@example.com        NaT  80000.0        Admin
42  Charlie      NaN     NaN  user42@example.com        NaT  70000.0  Engineering
43    David      NaN       F  user43@example.com        NaT  70000.0        Admin
44      Eva       35       F  user44@example.com        NaT      NaN  Engineering
45    Frank       40    Male  user45@example.com        NaT      NaN  Engineering
46    Grace      NaN       F  user46@example.com        NaT      NaN        Admin
47   Hannah       40   Other  user47@example.com        NaT      NaN        Sales
48      Ivy       25     NaN  user48@example.com        NaT      NaN    Marketing
49     Jack       35       F  user49@example.com        NaT      NaN  Engineering
50    Alice  unknown    Male  user50@example.com 2021-05-21      NaN        Admin
51      Bob       35   Other  user51@example.com        NaT      NaN        Admin
52  Charlie      NaN  Female  user52@example.com        NaT  70000.0           HR
53    David  unknown     NaN  user53@example.com        NaT      NaN    Marketing
54      Eva       25       F  user54@example.com        NaT  70000.0  Engineering
55    Frank      NaN    Male  user55@example.com        NaT  70000.0        Sales
56    Grace       30  Female  user56@example.com        NaT  60000.0  Engineering
57   Hannah       40  Female  user57@example.com        NaT      NaN    Marketing
58      Ivy       25       M  user58@example.com 2021-05-21      NaN    Marketing
59     Jack       40   Other  user59@example.com 2021-05-21  50000.0    Marketing
60    Alice      NaN       F  user60@example.com        NaT  80000.0  Engineering
61      Bob       30    Male  user61@example.com        NaT      NaN    Marketing
62  Charlie       30       M  user62@example.com        NaT  50000.0        Admin
63    David       25   Other  user63@example.com        NaT      NaN  Engineering
64      Eva       30       M  user64@example.com        NaT  80000.0    Marketing
65    Frank  unknown     NaN  user65@example.com        NaT      NaN        Admin
66    Grace       30   Other  user66@example.com        NaT  70000.0           HR
67   Hannah       40   Other  user67@example.com        NaT  80000.0    Marketing
68      Ivy       40       F  user68@example.com        NaT  70000.0  Engineering
69     Jack      NaN   Other  user69@example.com        NaT  50000.0  Engineering
70    Alice       40       M  user70@example.com        NaT  50000.0    Marketing
71      Bob      NaN   Other  user71@example.com        NaT  80000.0  Engineering
72  Charlie       40       F  user72@example.com        NaT  80000.0        Admin
73    David  unknown       F  user73@example.com        NaT      NaN           HR
74      Eva      NaN     NaN  user74@example.com        NaT      NaN        Sales
75    Frank       35       M  user75@example.com 2021-05-21      NaN           HR
76    Grace      NaN  Female  user76@example.com 2021-05-21      NaN    Marketing
77   Hannah       25  Female  user77@example.com        NaT      NaN  Engineering
78      Ivy       40   Other  user78@example.com 2021-05-21  70000.0  Engineering
79     Jack       30     NaN  user79@example.com        NaT  80000.0  Engineering
80    Alice       40    Male  user80@example.com        NaT  50000.0  Engineering
81      Bob       30   Other  user81@example.com 2021-05-21      NaN  Engineering
82  Charlie      NaN     NaN  user82@example.com 2021-05-21      NaN        Admin
83    David      NaN       M  user83@example.com        NaT  50000.0        Sales
84      Eva      NaN       M  user84@example.com        NaT      NaN    Marketing
85    Frank       30       M  user85@example.com        NaT      NaN  Engineering
86    Grace       40       M  user86@example.com        NaT      NaN        Sales
87   Hannah      NaN       M  user87@example.com        NaT  70000.0  Engineering
88      Ivy  unknown     NaN  user88@example.com        NaT  80000.0  Engineering
89     Jack      NaN     NaN  user89@example.com 2021-05-21  50000.0        Sales
90    Alice       30       F                   _        NaT  80000.0  Engineering
91      Bob       30  Female                   _        NaT      NaN        Admin
92  Charlie       40       M                   _ 2021-05-21      NaN        Admin
93    David       30    Male                   _        NaT      NaN        Sales
94      Eva       30     NaN                   _ 2021-05-21      NaN  Engineering
95    Frank      NaN    Male                   _        NaT  50000.0  Engineering
96    Grace       40    Male                   _        NaT  70000.0        Sales
97   Hannah      NaN    Male                   _        NaT  60000.0  Engineering
98      Ivy      NaN       F                   _        NaT  50000.0  Engineering
99     Jack      NaN     NaN                   _        NaT  60000.0        Admin